fr0ster/ILI-9325_stm32f103/Src/main.c

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2020 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"
#include "usart.h"
#include "gpio.h"

/* USER CODE BEGIN Includes */

	#include "lcd.h"
	#include <string.h>
	#include "stm32f1xx_hal_flash.h"
	#include "flash_stm32f103_hal_sm.h"

			// 		GPIO to data bus
			// D0 -> PA9
			// D1 -> PA7		//	PC7 BAZHEN CHANGE TO PA7	#define NEW_BIT1
			// D2 -> PA10
			// D3 -> PB3
			// D4 -> PB5
			// D5 -> PB4
			// D6 -> PB10
			// D7 -> PA8

			// 		GPIO to control bus
			// RST	->	PB1  	// PC1 BAZHEN CHANGE TO PB1	#define NEW_RST
			// CS	->	PB0
			// RS	->	PA4		(CD)
			// WR	->	PA1
			// RD	->	PA0


/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART1_UART_Init();
  /* USER CODE BEGIN 2 */

	typedef struct
	{
		UART_HandleTypeDef *uart;
	}	Debug_struct;
	Debug_struct DebugH;
	DebugH.uart = &huart1;
	#define	DEBUG_STRING_SIZE		100
	char DebugString[DEBUG_STRING_SIZE];

	sprintf(DebugString,"\r\n");
	HAL_UART_Transmit(DebugH.uart, (uint8_t *)DebugString, strlen(DebugString), 100);

	sprintf(DebugString,"VRG-2020 \r\nfor_debug UART1 115200/8-N-1\r\n");
	HAL_UART_Transmit(DebugH.uart, (uint8_t *)DebugString, strlen(DebugString), 100);


	LCD_Init();
	LCD_SetRotation(1);
	LCD_FillScreen(ILI92_WHITE);
	LCD_SetTextColor(ILI92_GREEN, ILI92_WHITE);
	LCD_Printf("\n START\n ");
	LCD_Printf("%s",DebugString);
	LCD_Printf(" 3D GLASS V2.0.0\n ");

	LCD_Printf("Flash read: ");
	uint32_t flash_word_u32 = Flash_Read(MY_FLASH_PAGE_ADDR);
	LCD_Printf("word_u32 = %x\n ", flash_word_u32);
	LCD_Printf("char= %s\n ", (char *)&flash_word_u32);

	#define STRING_LEFT  ((uint32_t)0x7466654C)
	#define STRING_RIGHT  ((uint32_t)0x74676952)

		#define WRITE_TO_FLASH	0
		#if WRITE_TO_FLASH == 1
			if (flash_word_u32 == STRING_LEFT)
			{
				LCD_Printf("FLASH_Unlock\n ");
				HAL_FLASH_Unlock();

				LCD_Printf("FLASH Erase Page\n ");
				Flash_Erase_Page(MY_FLASH_PAGE_ADDR);

				//uint32_t flash_string_u32 = STRING_LEFT;
				uint32_t flash_string_u32 = STRING_RIGHT;
				LCD_Printf("Write to flash: %s\n ",(char *)&flash_string_u32);
				Flash_Write( MY_FLASH_PAGE_ADDR, flash_string_u32);

				HAL_FLASH_Lock();
				LCD_Printf("HAL FLASH Lock\n ");
			}
			else
			{
				LCD_Printf("NO write to FLASH.\n ");
			}
		#endif

	switch (flash_word_u32)
	{
		 case 	STRING_LEFT:	LCD_SetRotation(3);		break;
		 case 	STRING_RIGHT:	LCD_SetRotation(1);		break;
		 default:				LCD_SetRotation(1);		break;
	}

//	LCD_FillScreen(ILI92_WHITE);
//	LCD_FillScreen(WHITE);
	LCD_Printf("rotation: %s\n ", (char *)&flash_word_u32);
	//LCD_SetCursor(0, 40);
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1) {
	for (int i=0; i<9; i++)	{
		LCD_SetCursor(80, 160);
		LCD_Printf("%d)",i);

		switch(i) {
			case  7: LCD_Printf(" Sunday    "); 	break;
			case  1: LCD_Printf(" Monday    ");		break;
			case  2: LCD_Printf(" Tuesday   "); 	break;
			case  3: LCD_Printf(" Wednesday ");		break;
			case  4: LCD_Printf(" Thursday  ");		break;
			case  5: LCD_Printf(" Friday    ");		break;
			case  6: LCD_Printf(" Saturday  ");		break;
			default: LCD_Printf(" Out of day");		break;
		} // end switch
		//LCD_Printf("\n ");

		//HAL_GPIO_TogglePin(LED_GREEN_GPIO_Port, LED_GREEN_Pin);
		HAL_Delay(1000);
	} // end for i=0

  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */

  }
  /* USER CODE END 3 */

}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  file: The file name as string.
  * @param  line: The line in file as a number.
  * @retval None
  */
void _Error_Handler(char *file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
